## Plan Result (sds_ptlsbox_ado)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Replace
  * azurerm_role_assignment.sops-kv-reader
  * azurerm_user_assigned_identity.azure-devops-mi




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.sops-kv-reader must be replaced
-/+ resource "azurerm_role_assignment" "sops-kv-reader" {
      ~ id                               = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/genesis-rg/providers/Microsoft.KeyVault/vaults/dtssdsptlsbox/providers/Microsoft.Authorization/roleAssignments/4ddc2e7a-a4ac-820c-b312-4e62fc3e9e32" -> (known after apply)
      ~ name                             = "4ddc2e7a-a4ac-820c-b312-4e62fc3e9e32" -> (known after apply)
      ~ principal_id                     = "d9812390-36f2-4283-b259-d0d584c7a3d5" -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_user_assigned_identity.azure-devops-mi must be replaced
-/+ resource "azurerm_user_assigned_identity" "azure-devops-mi" {
      ~ client_id           = "2d063d68-97f2-41ec-bf9f-fded6b8912ee" -> (known after apply)
      ~ id                  = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/managed-identities-ptlsbox-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/azure-devops-cftsbox-intsvc-mi" -> (known after apply)
      ~ name                = "azure-devops-cftsbox-intsvc-mi" -> "azure-devops-ptlsbox-mi" # forces replacement
      ~ principal_id        = "d9812390-36f2-4283-b259-d0d584c7a3d5" -> (known after apply)
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/ado-shared-infra"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
            "startupMode"  = "always"
        }
      ~ tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2,"Program":"tfcmt","SHA1":"","Target":"sds_ptlsbox_ado","Vars":{}} -->